; ModuleID = 'linked_cert-elements-oob-write_serializer-int32-oob-write.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ce_module = type { %struct.ce_packet }
%struct.ce_packet = type { i8*, i16 }
%struct.ce_flow = type { %struct.ce_module }
%struct.ser_private = type { %struct.ser_status, %struct.ser_buffer, i32, [2 x i8] }
%struct.ser_status = type { i32, %struct.ser_buf_status }
%struct.ser_buf_status = type { i32 }
%struct.ser_buffer = type { i32, i8* }
%struct.ser_serializer = type { [32 x i8] }

@.str = private unnamed_addr constant [4 x i8] c"buf\00", align 1
@main.existing_names = internal global [1 x i8] zeroinitializer, align 1, !dbg !0
@.str.1 = private unnamed_addr constant [8 x i8] c"srv_len\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"p_offset\00", align 1
@.str.3 = private unnamed_addr constant [10 x i8] c"size_used\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"value\00", align 1
@.str.6 = private unnamed_addr constant [71 x i8] c"0 && \22REACHED_BOTH_cert-elements-oob-write_serializer-int32-oob-write\22\00", align 1
@.str.7 = private unnamed_addr constant [60 x i8] c"driver_cert-elements-oob-write_serializer-int32-oob-write.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1

; Function Attrs: noinline noreturn nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "existing_names", scope: !2, file: !3, line: 59, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 46, type: !4, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !31)
!3 = !DIFile(filename: "driver_cert-elements-oob-write_serializer-int32-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !16, globals: !30, splitDebugInlining: false, nameTableKind: None)
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 32, baseType: !10, size: 32, elements: !11)
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "ser_fmt_unknown", value: 0)
!13 = !DIEnumerator(name: "ser_fmt_tlv", value: 1)
!14 = !DIEnumerator(name: "ser_fmt_json", value: 2)
!15 = !DIEnumerator(name: "ser_fmt_csv", value: 3)
!16 = !{!17, !21}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 26, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !10)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_serializer", file: !3, line: 41, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 41, size: 256, elements: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !23, file: !3, line: 41, baseType: !26, size: 256)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, elements: !28)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !{!29}
!29 = !DISubrange(count: 32)
!30 = !{!0}
!31 = !{}
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 1)
!35 = distinct !DICompileUnit(language: DW_LANG_C99, file: !36, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, retainedTypes: !37, splitDebugInlining: false, nameTableKind: None)
!36 = !DIFile(filename: "predicate_cert-elements-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!37 = !{!38, !39, !40, !44, !45}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !36, line: 28, baseType: !17)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !36, line: 27, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 25, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 40, baseType: !43)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !46, line: 79, baseType: !47)
!46 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !50, retainedTypes: !52, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "predicate_serializer-int32-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!50 = !{!51}
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 35, baseType: !10, size: 32, elements: !11)
!52 = !{!53, !39}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_private", file: !49, line: 62, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 57, size: 256, elements: !56)
!56 = !{!57, !68, !79, !81}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !55, file: !49, line: 58, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_status", file: !49, line: 50, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 47, size: 64, elements: !60)
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !59, file: !49, line: 48, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !49, line: 33, baseType: !17)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !59, file: !49, line: 49, baseType: !64, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buf_status", file: !49, line: 45, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 45, size: 32, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size_used", scope: !65, file: !49, line: 45, baseType: !62, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !55, file: !49, line: 59, baseType: !69, size: 128, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buffer", file: !49, line: 55, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 52, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !49, line: 53, baseType: !62, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !49, line: 54, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !49, line: 31, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 38, baseType: !78)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !55, file: !49, line: 60, baseType: !80, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_format", file: !49, line: 40, baseType: !51)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "csv_separator", scope: !55, file: !49, line: 61, baseType: !82, size: 16, offset: 224)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 16, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !31, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "/home/wcontrerasmartinez/klee/runtime/Freestanding/memset.c", directory: "/home/wcontrerasmartinez/klee/build/runtime/Freestanding")
!87 = !{!"Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8"}
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{i32 7, !"uwtable", i32 1}
!92 = !{i32 7, !"frame-pointer", i32 2}
!93 = !DILocalVariable(name: "buf", scope: !2, file: !3, line: 47, type: !94)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 256)
!97 = !DILocation(line: 47, column: 11, scope: !2)
!98 = !DILocation(line: 48, column: 22, scope: !2)
!99 = !DILocation(line: 48, column: 3, scope: !2)
!100 = !DILocalVariable(name: "ce_mod", scope: !2, file: !3, line: 51, type: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_module", file: !3, line: 26, size: 128, elements: !102)
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !101, file: !3, line: 26, baseType: !104, size: 128)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_packet", file: !3, line: 25, size: 128, elements: !105)
!105 = !{!106, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !104, file: !3, line: 25, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "payload_packet_len", scope: !104, file: !3, line: 25, baseType: !41, size: 16, offset: 64)
!110 = !DILocation(line: 51, column: 20, scope: !2)
!111 = !DILocalVariable(name: "ce_flow", scope: !2, file: !3, line: 52, type: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_flow", file: !3, line: 24, size: 128, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "protos", scope: !112, file: !3, line: 24, baseType: !115, size: 128)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !112, file: !3, line: 24, size: 128, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tls_quic", scope: !115, file: !3, line: 24, baseType: !118, size: 128)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_tls_quic", file: !3, line: 23, size: 128, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "server_names", scope: !118, file: !3, line: 23, baseType: !44, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "server_names_len", scope: !118, file: !3, line: 23, baseType: !41, size: 16, offset: 64)
!122 = !DILocation(line: 52, column: 20, scope: !2)
!123 = !DILocation(line: 53, column: 3, scope: !2)
!124 = !DILocation(line: 54, column: 3, scope: !2)
!125 = !DILocation(line: 56, column: 17, scope: !2)
!126 = !DILocation(line: 56, column: 36, scope: !2)
!127 = !DILocation(line: 60, column: 27, scope: !2)
!128 = !DILocation(line: 60, column: 40, scope: !2)
!129 = !DILocation(line: 63, column: 22, scope: !2)
!130 = !DILocalVariable(name: "srv_len", scope: !2, file: !3, line: 62, type: !41)
!131 = !DILocation(line: 0, scope: !2)
!132 = !DILocation(line: 63, column: 3, scope: !2)
!133 = !DILocation(line: 64, column: 15, scope: !2)
!134 = !DILocation(line: 64, column: 23, scope: !2)
!135 = !DILocation(line: 64, column: 3, scope: !2)
!136 = !DILocation(line: 65, column: 46, scope: !2)
!137 = !DILocation(line: 65, column: 44, scope: !2)
!138 = !DILocation(line: 68, column: 22, scope: !2)
!139 = !DILocalVariable(name: "p_offset", scope: !2, file: !3, line: 67, type: !41)
!140 = !DILocation(line: 68, column: 3, scope: !2)
!141 = !DILocation(line: 69, column: 15, scope: !2)
!142 = !DILocation(line: 69, column: 24, scope: !2)
!143 = !DILocation(line: 69, column: 3, scope: !2)
!144 = !DILocalVariable(name: "ser", scope: !2, file: !3, line: 72, type: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_private", file: !3, line: 40, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 256, elements: !147)
!147 = !{!148, !158, !165, !167}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !146, file: !3, line: 39, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_status", file: !3, line: 36, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 36, size: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !150, file: !3, line: 36, baseType: !17, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !150, file: !3, line: 36, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buf_status", file: !3, line: 35, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 35, size: 32, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "size_used", scope: !155, file: !3, line: 35, baseType: !17, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !146, file: !3, line: 39, baseType: !159, size: 128, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buffer", file: !3, line: 37, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 37, size: 128, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !3, line: 37, baseType: !17, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !3, line: 37, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !146, file: !3, line: 39, baseType: !166, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_format", file: !3, line: 33, baseType: !9)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "csv_separator", scope: !146, file: !3, line: 39, baseType: !82, size: 16, offset: 224)
!168 = !DILocation(line: 72, column: 15, scope: !2)
!169 = !DILocation(line: 73, column: 3, scope: !2)
!170 = !DILocation(line: 75, column: 7, scope: !2)
!171 = !DILocation(line: 75, column: 32, scope: !2)
!172 = !DILocation(line: 76, column: 14, scope: !2)
!173 = !DILocation(line: 76, column: 32, scope: !2)
!174 = !DILocation(line: 77, column: 3, scope: !2)
!175 = !DILocation(line: 77, column: 32, scope: !2)
!176 = !DILocation(line: 82, column: 22, scope: !2)
!177 = !DILocalVariable(name: "su", scope: !2, file: !3, line: 81, type: !17)
!178 = !DILocation(line: 82, column: 3, scope: !2)
!179 = !DILocation(line: 83, column: 15, scope: !2)
!180 = !DILocation(line: 83, column: 18, scope: !2)
!181 = !DILocation(line: 83, column: 3, scope: !2)
!182 = !DILocation(line: 84, column: 15, scope: !2)
!183 = !DILocation(line: 84, column: 18, scope: !2)
!184 = !DILocation(line: 84, column: 24, scope: !2)
!185 = !DILocation(line: 84, column: 3, scope: !2)
!186 = !DILocation(line: 85, column: 34, scope: !2)
!187 = !DILocation(line: 85, column: 21, scope: !2)
!188 = !DILocation(line: 85, column: 32, scope: !2)
!189 = !DILocation(line: 86, column: 14, scope: !2)
!190 = !DILocation(line: 86, column: 32, scope: !2)
!191 = !DILocation(line: 87, column: 14, scope: !2)
!192 = !DILocation(line: 87, column: 32, scope: !2)
!193 = !DILocation(line: 90, column: 22, scope: !2)
!194 = !DILocalVariable(name: "value", scope: !2, file: !3, line: 89, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !196, line: 26, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !20, line: 41, baseType: !6)
!198 = !DILocation(line: 90, column: 3, scope: !2)
!199 = !DILocation(line: 92, column: 25, scope: !2)
!200 = !DILocation(line: 92, column: 31, scope: !2)
!201 = !DILocation(line: 92, column: 15, scope: !2)
!202 = !DILocation(line: 92, column: 3, scope: !2)
!203 = !DILocation(line: 94, column: 26, scope: !2)
!204 = !DILocalVariable(name: "sser", scope: !2, file: !3, line: 94, type: !21)
!205 = !DILocation(line: 97, column: 50, scope: !2)
!206 = !DILocation(line: 96, column: 15, scope: !2)
!207 = !DILocalVariable(name: "r_ce", scope: !2, file: !3, line: 96, type: !6)
!208 = !DILocation(line: 98, column: 15, scope: !2)
!209 = !DILocalVariable(name: "r_ser", scope: !2, file: !3, line: 98, type: !6)
!210 = !DILocation(line: 100, column: 20, scope: !2)
!211 = !DILocation(line: 100, column: 25, scope: !2)
!212 = !DILocation(line: 100, column: 15, scope: !2)
!213 = !DILocation(line: 100, column: 3, scope: !2)
!214 = !DILocation(line: 101, column: 3, scope: !2)
!215 = distinct !DISubprogram(name: "predicate_cert_elements_oob_write", scope: !36, file: !36, line: 49, type: !216, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !31)
!216 = !DISubroutineType(types: !217)
!217 = !{!6, !218, !229, !40, !40}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_module", file: !36, line: 45, size: 128, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !219, file: !36, line: 46, baseType: !222, size: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_packet", file: !36, line: 40, size: 128, elements: !223)
!223 = !{!224, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !222, file: !36, line: 41, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !36, line: 26, baseType: !76)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "payload_packet_len", scope: !222, file: !36, line: 42, baseType: !40, size: 16, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_flow", file: !36, line: 36, size: 128, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "protos", scope: !230, file: !36, line: 37, baseType: !233, size: 128)
!233 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !230, file: !36, line: 37, size: 128, elements: !234)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tls_quic", scope: !233, file: !36, line: 37, baseType: !236, size: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ce_tls_quic", file: !36, line: 31, size: 128, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "server_names", scope: !236, file: !36, line: 32, baseType: !44, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "server_names_len", scope: !236, file: !36, line: 33, baseType: !40, size: 16, offset: 64)
!240 = !DILocalVariable(name: "ndpi_struct", arg: 1, scope: !215, file: !36, line: 50, type: !218)
!241 = !DILocation(line: 0, scope: !215)
!242 = !DILocalVariable(name: "flow", arg: 2, scope: !215, file: !36, line: 51, type: !229)
!243 = !DILocalVariable(name: "p_offset", arg: 3, scope: !215, file: !36, line: 52, type: !40)
!244 = !DILocalVariable(name: "certificate_len", arg: 4, scope: !215, file: !36, line: 53, type: !40)
!245 = !DILocalVariable(name: "packet", scope: !215, file: !36, line: 55, type: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!247 = !DILocalVariable(name: "i", scope: !215, file: !36, line: 56, type: !40)
!248 = !DILocation(line: 58, column: 24, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !36, line: 58, column: 3)
!250 = distinct !DILexicalBlock(scope: !215, file: !36, line: 58, column: 3)
!251 = !DILocation(line: 58, column: 3, scope: !250)
!252 = !DILocation(line: 60, column: 37, scope: !253)
!253 = distinct !DILexicalBlock(scope: !254, file: !36, line: 60, column: 9)
!254 = distinct !DILexicalBlock(scope: !249, file: !36, line: 58, column: 48)
!255 = !DILocation(line: 60, column: 9, scope: !253)
!256 = !DILocation(line: 60, column: 22, scope: !253)
!257 = !DILocation(line: 60, column: 29, scope: !253)
!258 = !DILocation(line: 60, column: 26, scope: !253)
!259 = !DILocation(line: 60, column: 9, scope: !254)
!260 = !DILocation(line: 62, column: 18, scope: !261)
!261 = distinct !DILexicalBlock(scope: !254, file: !36, line: 62, column: 9)
!262 = !DILocation(line: 62, column: 10, scope: !261)
!263 = !DILocation(line: 62, column: 31, scope: !261)
!264 = !DILocation(line: 62, column: 40, scope: !261)
!265 = !DILocation(line: 63, column: 27, scope: !261)
!266 = !DILocation(line: 63, column: 10, scope: !261)
!267 = !DILocation(line: 63, column: 31, scope: !261)
!268 = !DILocation(line: 63, column: 40, scope: !261)
!269 = !DILocation(line: 64, column: 27, scope: !261)
!270 = !DILocation(line: 64, column: 10, scope: !261)
!271 = !DILocation(line: 64, column: 31, scope: !261)
!272 = !DILocation(line: 62, column: 9, scope: !254)
!273 = !DILocation(line: 67, column: 9, scope: !274)
!274 = distinct !DILexicalBlock(scope: !261, file: !36, line: 64, column: 41)
!275 = !DILocation(line: 68, column: 13, scope: !276)
!276 = distinct !DILexicalBlock(scope: !274, file: !36, line: 68, column: 11)
!277 = !DILocation(line: 68, column: 11, scope: !274)
!278 = !DILocation(line: 71, column: 11, scope: !279)
!279 = distinct !DILexicalBlock(scope: !274, file: !36, line: 71, column: 11)
!280 = !DILocation(line: 71, column: 30, scope: !279)
!281 = !DILocation(line: 71, column: 11, scope: !274)
!282 = !DILocation(line: 73, column: 13, scope: !283)
!283 = distinct !DILexicalBlock(scope: !274, file: !36, line: 73, column: 11)
!284 = !DILocation(line: 73, column: 11, scope: !274)
!285 = !DILocation(line: 76, column: 13, scope: !274)
!286 = !DILocation(line: 76, column: 12, scope: !274)
!287 = !DILocation(line: 76, column: 9, scope: !274)
!288 = !DILocation(line: 77, column: 13, scope: !289)
!289 = distinct !DILexicalBlock(scope: !274, file: !36, line: 77, column: 11)
!290 = !DILocation(line: 77, column: 11, scope: !274)
!291 = !DILocation(line: 79, column: 9, scope: !274)
!292 = !DILocation(line: 80, column: 13, scope: !293)
!293 = distinct !DILexicalBlock(scope: !274, file: !36, line: 80, column: 11)
!294 = !DILocation(line: 80, column: 11, scope: !274)
!295 = !DILocation(line: 83, column: 13, scope: !274)
!296 = !DILocation(line: 83, column: 12, scope: !274)
!297 = !DILocation(line: 83, column: 9, scope: !274)
!298 = !DILocation(line: 84, column: 8, scope: !274)
!299 = !DILocation(line: 86, column: 16, scope: !274)
!300 = !DILocation(line: 86, column: 7, scope: !274)
!301 = !DILocation(line: 87, column: 36, scope: !302)
