; ModuleID = 'linked_strncasestr-oob-read_serializer-int32-oob-write.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ser_private = type { %struct.ser_status, %struct.ser_buffer, i32, [2 x i8] }
%struct.ser_status = type { i32, %struct.ser_buf_status }
%struct.ser_buf_status = type { i32 }
%struct.ser_buffer = type { i32, i8* }
%struct.ser_serializer = type { [32 x i8] }

@.str = private unnamed_addr constant [4 x i8] c"buf\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"needle\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"size_used\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"value\00", align 1
@.str.5 = private unnamed_addr constant [68 x i8] c"0 && \22REACHED_BOTH_strncasestr-oob-read_serializer-int32-oob-write\22\00", align 1
@.str.6 = private unnamed_addr constant [57 x i8] c"driver_strncasestr-oob-read_serializer-int32-oob-write.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1

; Function Attrs: noinline noreturn nounwind uwtable
define dso_local i32 @main() local_unnamed_addr #0 !dbg !76 {
  %1 = alloca [256 x i8], align 16
  %2 = alloca [258 x i8], align 16
  %3 = alloca %struct.ser_private, align 8
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "driver_strncasestr-oob-read_serializer-int32-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 25, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "ser_fmt_unknown", value: 0)
!7 = !DIEnumerator(name: "ser_fmt_tlv", value: 1)
!8 = !DIEnumerator(name: "ser_fmt_json", value: 2)
!9 = !DIEnumerator(name: "ser_fmt_csv", value: 3)
!10 = !{!11, !15, !24}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 26, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !14, line: 42, baseType: !4)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_serializer", file: !1, line: 34, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 34, size: 256, elements: !18)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !17, file: !1, line: 34, baseType: !20, size: 256)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !22)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{!23}
!23 = !DISubrange(count: 32)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!26 = distinct !DICompileUnit(language: DW_LANG_C99, file: !27, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !28, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!27 = !DIFile(filename: "predicate_strncasestr-oob-read.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!28 = !{}
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = distinct !DICompileUnit(language: DW_LANG_C99, file: !32, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !33, retainedTypes: !35, splitDebugInlining: false, nameTableKind: None)
!32 = !DIFile(filename: "predicate_serializer-int32-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!33 = !{!34}
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 35, baseType: !4, size: 32, elements: !5)
!35 = !{!36, !30}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_private", file: !32, line: 62, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 57, size: 256, elements: !39)
!39 = !{!40, !51, !62, !64}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !38, file: !32, line: 58, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_status", file: !32, line: 50, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 47, size: 64, elements: !43)
!43 = !{!44, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !32, line: 48, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !32, line: 33, baseType: !11)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !42, file: !32, line: 49, baseType: !47, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buf_status", file: !32, line: 45, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 45, size: 32, elements: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size_used", scope: !48, file: !32, line: 45, baseType: !45, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !38, file: !32, line: 59, baseType: !52, size: 128, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buffer", file: !32, line: 55, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 52, size: 128, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !53, file: !32, line: 53, baseType: !45, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !32, line: 54, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !32, line: 31, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !12, line: 24, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !14, line: 38, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !38, file: !32, line: 60, baseType: !63, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_format", file: !32, line: 40, baseType: !34)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "csv_separator", scope: !38, file: !32, line: 61, baseType: !65, size: 16, offset: 224)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 16, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 2)
!68 = distinct !DICompileUnit(language: DW_LANG_C99, file: !69, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !28, splitDebugInlining: false, nameTableKind: None)
!69 = !DIFile(filename: "/home/wcontrerasmartinez/klee/runtime/Freestanding/memset.c", directory: "/home/wcontrerasmartinez/klee/build/runtime/Freestanding")
!70 = !{!"Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8"}
!71 = !{i32 7, !"Dwarf Version", i32 4}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{i32 1, !"wchar_size", i32 4}
!74 = !{i32 7, !"uwtable", i32 1}
!75 = !{i32 7, !"frame-pointer", i32 2}
!76 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 39, type: !77, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !28)
!77 = !DISubroutineType(types: !78)
!78 = !{!79}
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DILocalVariable(name: "buf", scope: !76, file: !1, line: 40, type: !81)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2048, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 256)
!84 = !DILocation(line: 40, column: 11, scope: !76)
!85 = !DILocation(line: 41, column: 22, scope: !76)
!86 = !DILocation(line: 41, column: 3, scope: !76)
!87 = !DILocalVariable(name: "needle", scope: !76, file: !1, line: 44, type: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2064, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 258)
!91 = !DILocation(line: 44, column: 8, scope: !76)
!92 = !DILocation(line: 45, column: 22, scope: !76)
!93 = !DILocation(line: 45, column: 3, scope: !76)
!94 = !DILocation(line: 46, column: 3, scope: !76)
!95 = !DILocation(line: 46, column: 23, scope: !76)
!96 = !DILocalVariable(name: "k", scope: !97, file: !1, line: 47, type: !79)
!97 = distinct !DILexicalBlock(scope: !76, file: !1, line: 47, column: 3)
!98 = !DILocation(line: 0, scope: !97)
!99 = !DILocation(line: 47, column: 3, scope: !97)
!100 = !DILocation(line: 48, column: 17, scope: !101)
!101 = distinct !DILexicalBlock(scope: !97, file: !1, line: 47, column: 3)
!102 = !DILocation(line: 48, column: 27, scope: !101)
!103 = !DILocation(line: 48, column: 5, scope: !101)
!104 = !DILocation(line: 47, column: 33, scope: !101)
!105 = !DILocation(line: 47, column: 21, scope: !101)
!106 = distinct !{!106, !99, !107, !108}
!107 = !DILocation(line: 48, column: 34, scope: !97)
!108 = !{!"llvm.loop.mustprogress"}
!109 = !DILocalVariable(name: "ser", scope: !76, file: !1, line: 51, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_private", file: !1, line: 33, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 31, size: 256, elements: !112)
!112 = !{!113, !123, !130, !132}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !111, file: !1, line: 32, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_status", file: !1, line: 29, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 29, size: 64, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !1, line: 29, baseType: !11, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !115, file: !1, line: 29, baseType: !119, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buf_status", file: !1, line: 28, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 28, size: 32, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size_used", scope: !120, file: !1, line: 28, baseType: !11, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !111, file: !1, line: 32, baseType: !124, size: 128, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buffer", file: !1, line: 30, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 30, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !125, file: !1, line: 30, baseType: !11, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !1, line: 30, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !111, file: !1, line: 32, baseType: !131, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_format", file: !1, line: 26, baseType: !3)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "csv_separator", scope: !111, file: !1, line: 32, baseType: !65, size: 16, offset: 224)
!133 = !DILocation(line: 51, column: 15, scope: !76)
!134 = !DILocation(line: 52, column: 3, scope: !76)
!135 = !DILocation(line: 54, column: 7, scope: !76)
!136 = !DILocation(line: 54, column: 24, scope: !76)
!137 = !DILocation(line: 55, column: 14, scope: !76)
!138 = !DILocation(line: 55, column: 24, scope: !76)
!139 = !DILocation(line: 56, column: 3, scope: !76)
!140 = !DILocation(line: 56, column: 24, scope: !76)
!141 = !DILocation(line: 57, column: 14, scope: !76)
!142 = !DILocation(line: 57, column: 24, scope: !76)
!143 = !DILocation(line: 60, column: 22, scope: !76)
!144 = !DILocalVariable(name: "su", scope: !76, file: !1, line: 59, type: !11)
!145 = !DILocation(line: 0, scope: !76)
!146 = !DILocation(line: 60, column: 3, scope: !76)
!147 = !DILocation(line: 61, column: 15, scope: !76)
!148 = !DILocation(line: 61, column: 18, scope: !76)
!149 = !DILocation(line: 61, column: 3, scope: !76)
!150 = !DILocation(line: 62, column: 15, scope: !76)
!151 = !DILocation(line: 62, column: 18, scope: !76)
!152 = !DILocation(line: 62, column: 24, scope: !76)
!153 = !DILocation(line: 62, column: 3, scope: !76)
!154 = !DILocation(line: 63, column: 33, scope: !76)
!155 = !DILocation(line: 63, column: 21, scope: !76)
!156 = !DILocation(line: 63, column: 31, scope: !76)
!157 = !DILocation(line: 64, column: 14, scope: !76)
!158 = !DILocation(line: 64, column: 31, scope: !76)
!159 = !DILocation(line: 67, column: 22, scope: !76)
!160 = !DILocalVariable(name: "value", scope: !76, file: !1, line: 66, type: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !162, line: 26, baseType: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !14, line: 41, baseType: !79)
!164 = !DILocation(line: 67, column: 3, scope: !76)
!165 = !DILocation(line: 68, column: 25, scope: !76)
!166 = !DILocation(line: 68, column: 31, scope: !76)
!167 = !DILocation(line: 68, column: 15, scope: !76)
!168 = !DILocation(line: 68, column: 3, scope: !76)
!169 = !DILocation(line: 70, column: 26, scope: !76)
!170 = !DILocalVariable(name: "sser", scope: !76, file: !1, line: 70, type: !15)
!171 = !DILocation(line: 72, column: 15, scope: !76)
!172 = !DILocalVariable(name: "r_str", scope: !76, file: !1, line: 72, type: !79)
!173 = !DILocation(line: 74, column: 15, scope: !76)
!174 = !DILocalVariable(name: "r_ser", scope: !76, file: !1, line: 74, type: !79)
!175 = !DILocation(line: 76, column: 21, scope: !76)
!176 = !DILocation(line: 76, column: 26, scope: !76)
!177 = !DILocation(line: 76, column: 15, scope: !76)
!178 = !DILocation(line: 76, column: 3, scope: !76)
!179 = !DILocation(line: 77, column: 3, scope: !76)
!180 = distinct !DISubprogram(name: "predicate_strncasestr_oob_read", scope: !27, file: !27, line: 22, type: !181, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !28)
!181 = !DISubroutineType(types: !182)
!182 = !{!79, !24, !24, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 46, baseType: !185)
!184 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!185 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!186 = !DILocalVariable(name: "str1", arg: 1, scope: !180, file: !27, line: 22, type: !24)
!187 = !DILocation(line: 0, scope: !180)
!188 = !DILocalVariable(name: "str2", arg: 2, scope: !180, file: !27, line: 22, type: !24)
!189 = !DILocalVariable(name: "len", arg: 3, scope: !180, file: !27, line: 23, type: !183)
!190 = !DILocation(line: 25, column: 12, scope: !191)
!191 = distinct !DILexicalBlock(scope: !180, file: !27, line: 25, column: 7)
!192 = !DILocation(line: 25, column: 20, scope: !191)
!193 = !DILocalVariable(name: "str1_len", scope: !180, file: !27, line: 28, type: !183)
