; ModuleID = 'linked_printable-string-oob-read_serializer-int32-oob-write.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ser_private = type { %struct.ser_status, %struct.ser_buffer, i32, [2 x i8] }
%struct.ser_status = type { i32, %struct.ser_buf_status }
%struct.ser_buf_status = type { i32 }
%struct.ser_buffer = type { i32, i8* }
%struct.ser_serializer = type { [32 x i8] }

@.str = private unnamed_addr constant [4 x i8] c"buf\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"ps_len\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"size_used\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"value\00", align 1
@.str.5 = private unnamed_addr constant [73 x i8] c"0 && \22REACHED_BOTH_printable-string-oob-read_serializer-int32-oob-write\22\00", align 1
@.str.6 = private unnamed_addr constant [62 x i8] c"driver_printable-string-oob-read_serializer-int32-oob-write.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [15 x i8] c"int main(void)\00", align 1

; Function Attrs: noinline noreturn nounwind uwtable
define dso_local i32 @main() local_unnamed_addr #0 !dbg !78 {
  %1 = alloca [256 x i8], align 16
  %2 = alloca i64, align 8
  %3 = alloca %struct.ser_private, align 8
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "driver_printable-string-oob-read_serializer-int32-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 24, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "ser_fmt_unknown", value: 0)
!7 = !DIEnumerator(name: "ser_fmt_tlv", value: 1)
!8 = !DIEnumerator(name: "ser_fmt_json", value: 2)
!9 = !DIEnumerator(name: "ser_fmt_csv", value: 3)
!10 = !{!11, !14, !18, !27}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 46, baseType: !13)
!12 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 26, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 42, baseType: !4)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_serializer", file: !1, line: 33, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 33, size: 256, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !20, file: !1, line: 33, baseType: !23, size: 256)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 256, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!28 = distinct !DICompileUnit(language: DW_LANG_C99, file: !29, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, retainedTypes: !31, splitDebugInlining: false, nameTableKind: None)
!29 = !DIFile(filename: "predicate_printable-string-oob-read.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!30 = !{}
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = distinct !DICompileUnit(language: DW_LANG_C99, file: !34, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !37, splitDebugInlining: false, nameTableKind: None)
!34 = !DIFile(filename: "predicate_serializer-int32-oob-write.c", directory: "/home/wcontrerasmartinez/paper_bugs")
!35 = !{!36}
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 35, baseType: !4, size: 32, elements: !5)
!37 = !{!38, !32}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_private", file: !34, line: 62, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 57, size: 256, elements: !41)
!41 = !{!42, !53, !64, !66}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !40, file: !34, line: 58, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_status", file: !34, line: 50, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 47, size: 64, elements: !45)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !34, line: 48, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !34, line: 33, baseType: !14)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !44, file: !34, line: 49, baseType: !49, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buf_status", file: !34, line: 45, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 45, size: 32, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size_used", scope: !50, file: !34, line: 45, baseType: !47, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !40, file: !34, line: 59, baseType: !54, size: 128, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buffer", file: !34, line: 55, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 52, size: 128, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !34, line: 53, baseType: !47, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !55, file: !34, line: 54, baseType: !59, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !34, line: 31, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 24, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 38, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !40, file: !34, line: 60, baseType: !65, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_format", file: !34, line: 40, baseType: !36)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "csv_separator", scope: !40, file: !34, line: 61, baseType: !67, size: 16, offset: 224)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 2)
!70 = distinct !DICompileUnit(language: DW_LANG_C99, file: !71, producer: "Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, splitDebugInlining: false, nameTableKind: None)
!71 = !DIFile(filename: "/home/wcontrerasmartinez/klee/runtime/Freestanding/memset.c", directory: "/home/wcontrerasmartinez/klee/build/runtime/Freestanding")
!72 = !{!"Ubuntu clang version 13.0.1-++20220217091255+75e33f71c2da-1~exp1~20220217091338.8"}
!73 = !{i32 7, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 1, !"wchar_size", i32 4}
!76 = !{i32 7, !"uwtable", i32 1}
!77 = !{i32 7, !"frame-pointer", i32 2}
!78 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 38, type: !79, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !30)
!79 = !DISubroutineType(types: !80)
!80 = !{!81}
!81 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!82 = !DILocalVariable(name: "buf", scope: !78, file: !1, line: 39, type: !83)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 256)
!86 = !DILocation(line: 39, column: 11, scope: !78)
!87 = !DILocation(line: 40, column: 22, scope: !78)
!88 = !DILocation(line: 40, column: 3, scope: !78)
!89 = !DILocation(line: 44, column: 22, scope: !78)
!90 = !DILocalVariable(name: "ps_len", scope: !78, file: !1, line: 43, type: !11)
!91 = !DILocation(line: 0, scope: !78)
!92 = !DILocation(line: 44, column: 3, scope: !78)
!93 = !DILocation(line: 45, column: 15, scope: !78)
!94 = !DILocation(line: 45, column: 22, scope: !78)
!95 = !DILocation(line: 45, column: 3, scope: !78)
!96 = !DILocation(line: 46, column: 15, scope: !78)
!97 = !DILocation(line: 46, column: 22, scope: !78)
!98 = !DILocation(line: 46, column: 3, scope: !78)
!99 = !DILocalVariable(name: "ser", scope: !78, file: !1, line: 49, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_private", file: !1, line: 32, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 30, size: 256, elements: !102)
!102 = !{!103, !113, !120, !122}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !101, file: !1, line: 31, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_status", file: !1, line: 28, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 28, size: 64, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !1, line: 28, baseType: !14, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !105, file: !1, line: 28, baseType: !109, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buf_status", file: !1, line: 27, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 27, size: 32, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "size_used", scope: !110, file: !1, line: 27, baseType: !14, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !101, file: !1, line: 31, baseType: !114, size: 128, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_buffer", file: !1, line: 29, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 29, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !115, file: !1, line: 29, baseType: !14, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !1, line: 29, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !101, file: !1, line: 31, baseType: !121, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ser_format", file: !1, line: 25, baseType: !3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "csv_separator", scope: !101, file: !1, line: 31, baseType: !67, size: 16, offset: 224)
!123 = !DILocation(line: 49, column: 15, scope: !78)
!124 = !DILocation(line: 50, column: 3, scope: !78)
!125 = !DILocation(line: 52, column: 7, scope: !78)
!126 = !DILocation(line: 52, column: 24, scope: !78)
!127 = !DILocation(line: 53, column: 14, scope: !78)
!128 = !DILocation(line: 53, column: 24, scope: !78)
!129 = !DILocation(line: 54, column: 3, scope: !78)
!130 = !DILocation(line: 54, column: 24, scope: !78)
!131 = !DILocation(line: 55, column: 14, scope: !78)
!132 = !DILocation(line: 55, column: 24, scope: !78)
!133 = !DILocation(line: 58, column: 22, scope: !78)
!134 = !DILocalVariable(name: "su", scope: !78, file: !1, line: 57, type: !14)
!135 = !DILocation(line: 58, column: 3, scope: !78)
!136 = !DILocation(line: 59, column: 15, scope: !78)
!137 = !DILocation(line: 59, column: 18, scope: !78)
!138 = !DILocation(line: 59, column: 3, scope: !78)
!139 = !DILocation(line: 60, column: 15, scope: !78)
!140 = !DILocation(line: 60, column: 18, scope: !78)
!141 = !DILocation(line: 60, column: 24, scope: !78)
!142 = !DILocation(line: 60, column: 3, scope: !78)
!143 = !DILocation(line: 61, column: 33, scope: !78)
!144 = !DILocation(line: 61, column: 21, scope: !78)
!145 = !DILocation(line: 61, column: 31, scope: !78)
!146 = !DILocation(line: 62, column: 14, scope: !78)
!147 = !DILocation(line: 62, column: 31, scope: !78)
!148 = !DILocation(line: 65, column: 22, scope: !78)
!149 = !DILocalVariable(name: "value", scope: !78, file: !1, line: 64, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !151, line: 26, baseType: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !17, line: 41, baseType: !81)
!153 = !DILocation(line: 65, column: 3, scope: !78)
!154 = !DILocation(line: 66, column: 25, scope: !78)
!155 = !DILocation(line: 66, column: 31, scope: !78)
!156 = !DILocation(line: 66, column: 15, scope: !78)
!157 = !DILocation(line: 66, column: 3, scope: !78)
!158 = !DILocation(line: 68, column: 26, scope: !78)
!159 = !DILocalVariable(name: "sser", scope: !78, file: !1, line: 68, type: !18)
!160 = !DILocation(line: 70, column: 64, scope: !78)
!161 = !DILocation(line: 70, column: 15, scope: !78)
!162 = !DILocalVariable(name: "r_ps", scope: !78, file: !1, line: 70, type: !81)
!163 = !DILocation(line: 72, column: 15, scope: !78)
!164 = !DILocalVariable(name: "r_ser", scope: !78, file: !1, line: 72, type: !81)
!165 = !DILocation(line: 74, column: 20, scope: !78)
!166 = !DILocation(line: 74, column: 25, scope: !78)
!167 = !DILocation(line: 74, column: 15, scope: !78)
!168 = !DILocation(line: 74, column: 3, scope: !78)
!169 = !DILocation(line: 75, column: 3, scope: !78)
!170 = distinct !DISubprogram(name: "predicate_printable_string_oob_read", scope: !29, file: !29, line: 20, type: !171, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !30)
!171 = !DISubroutineType(types: !172)
!172 = !{!81, !173, !11, !11}
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!174 = !DILocalVariable(name: "str", arg: 1, scope: !170, file: !29, line: 20, type: !173)
!175 = !DILocation(line: 0, scope: !170)
!176 = !DILocalVariable(name: "len", arg: 2, scope: !170, file: !29, line: 20, type: !11)
!177 = !DILocalVariable(name: "buf_size", arg: 3, scope: !170, file: !29, line: 21, type: !11)
!178 = !DILocation(line: 23, column: 11, scope: !179)
!179 = distinct !DILexicalBlock(scope: !170, file: !29, line: 23, column: 7)
!180 = !DILocation(line: 23, column: 7, scope: !170)
!181 = !DILocation(line: 33, column: 1, scope: !170)
!182 = distinct !DISubprogram(name: "predicate_serializer_int32_oob_write", scope: !34, file: !34, line: 66, type: !183, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !30)
