; ModuleID = '/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness/slice.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.netdissect_options = type { i32, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }

@.str = private unnamed_addr constant [4 x i8] c"ndo\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"h\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"p\00", align 1
@.str.3 = private unnamed_addr constant [31 x i8] c"SPINE_PROBE:cip_if_print:ENTRY\00", align 1
@.str.1.4 = private unnamed_addr constant [7 x i8] c"\AA\AA\03\00\00\00\00", align 1
@.str.2.5 = private unnamed_addr constant [27 x i8] c"0 && \22SAILOR_SINK_REACHED\22\00", align 1
@.str.3.6 = private unnamed_addr constant [107 x i8] c"/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness/print-cip.c\00", align 1
@__PRETTY_FUNCTION__.cip_if_print = private unnamed_addr constant [85 x i8] c"u_int cip_if_print(netdissect_options *, const struct pcap_pkthdr *, const u_char *)\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main() local_unnamed_addr #0 !dbg !52 {
  %1 = alloca i32, align 4
  %2 = alloca %struct.netdissect_options*, align 8
  %3 = alloca %struct.pcap_pkthdr*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness/driver.c", directory: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness", checksumkind: CSK_MD5, checksum: "7925c318041ca50c5df3e9acdf72a78f")
!2 = !{!3, !11, !33}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdissect_options", file: !5, line: 15, baseType: !6)
!5 = !DIFile(filename: "harness_types.h", directory: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness", checksumkind: CSK_MD5, checksum: "18256b5584b59f2879f4a41daad03ddf")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdissect_options", file: !5, line: 12, size: 64, elements: !7)
!7 = !{!8, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_eflag", scope: !6, file: !5, line: 13, baseType: !9, size: 32)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_suppress_default_print", scope: !6, file: !5, line: 14, baseType: !9, size: 32, offset: 32)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !13, line: 245, size: 192, elements: !14)
!13 = !DIFile(filename: "/usr/include/pcap/pcap.h", directory: "", checksumkind: CSK_MD5, checksum: "df342b11dea7ddce117571532923c631")
!14 = !{!15, !25, !32}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !12, file: !13, line: 246, baseType: !16, size: 128)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !17, line: 8, size: 128, elements: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!18 = !{!19, !23}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !16, file: !17, line: 14, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !21, line: 160, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!22 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !16, file: !17, line: 15, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !21, line: 162, baseType: !22)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !12, file: !13, line: 247, baseType: !26, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !27, line: 98, baseType: !28)
!27 = !DIFile(filename: "/usr/include/pcap/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "e736341f781a19c2dd15abe08571efa1")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !29, line: 35, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !21, line: 33, baseType: !31)
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !12, file: !13, line: 248, baseType: !26, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !5, line: 10, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = distinct !DICompileUnit(language: DW_LANG_C99, file: !37, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !38, splitDebugInlining: false, nameTableKind: None)
!37 = !DIFile(filename: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness/print-cip.c", directory: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness", checksumkind: CSK_MD5, checksum: "d77cd0d856bd4fad478795ae540f9fc3")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = distinct !DICompileUnit(language: DW_LANG_C99, file: !41, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!41 = !DIFile(filename: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness/smart_stubs.c", directory: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness", checksumkind: CSK_MD5, checksum: "bcda1acd1a733c696e028616d9d6f3b5")
!42 = distinct !DICompileUnit(language: DW_LANG_C99, file: !43, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!43 = !DIFile(filename: "/opt/tools/klee/runtime/Freestanding/memcmp.c", directory: "/opt/tools/klee/build/runtime/Freestanding", checksumkind: CSK_MD5, checksum: "5350b831de232a5be5b37d49ccbaf0ef")
!44 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!45 = !{i32 7, !"Dwarf Version", i32 5}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{i32 1, !"wchar_size", i32 4}
!48 = !{i32 7, !"PIC Level", i32 2}
!49 = !{i32 7, !"PIE Level", i32 2}
!50 = !{i32 7, !"uwtable", i32 1}
!51 = !{i32 7, !"frame-pointer", i32 2}
!52 = distinct !DISubprogram(name: "main", scope: !53, file: !53, line: 8, type: !54, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !56)
!53 = !DIFile(filename: "driver.c", directory: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness", checksumkind: CSK_MD5, checksum: "7925c318041ca50c5df3e9acdf72a78f")
!54 = !DISubroutineType(types: !55)
!55 = !{!9}
!56 = !{}
!57 = !DILocalVariable(name: "ndo", scope: !52, file: !53, line: 9, type: !3)
!58 = !DILocation(line: 9, column: 25, scope: !52)
!59 = !DILocation(line: 9, column: 53, scope: !52)
!60 = !DILocation(line: 9, column: 31, scope: !52)
!61 = !DILocalVariable(name: "h", scope: !52, file: !53, line: 10, type: !11)
!62 = !DILocation(line: 10, column: 25, scope: !52)
!63 = !DILocation(line: 10, column: 51, scope: !52)
!64 = !DILocation(line: 10, column: 29, scope: !52)
!65 = !DILocalVariable(name: "p", scope: !52, file: !53, line: 11, type: !33)
!66 = !DILocation(line: 11, column: 13, scope: !52)
!67 = !DILocation(line: 11, column: 27, scope: !52)
!68 = !DILocation(line: 13, column: 24, scope: !52)
!69 = !DILocation(line: 13, column: 5, scope: !52)
!70 = !DILocation(line: 14, column: 24, scope: !52)
!71 = !DILocation(line: 14, column: 5, scope: !52)
!72 = !DILocation(line: 15, column: 24, scope: !52)
!73 = !DILocation(line: 15, column: 5, scope: !52)
!74 = !DILocation(line: 17, column: 5, scope: !52)
!75 = !DILocation(line: 17, column: 10, scope: !52)
!76 = !DILocation(line: 17, column: 20, scope: !52)
!77 = !DILocation(line: 18, column: 5, scope: !52)
!78 = !DILocation(line: 18, column: 10, scope: !52)
!79 = !DILocation(line: 18, column: 37, scope: !52)
!80 = !DILocation(line: 19, column: 5, scope: !52)
!81 = !DILocation(line: 19, column: 8, scope: !52)
!82 = !DILocation(line: 19, column: 15, scope: !52)
!83 = !DILocation(line: 20, column: 5, scope: !52)
!84 = !DILocation(line: 20, column: 8, scope: !52)
!85 = !DILocation(line: 20, column: 12, scope: !52)
!86 = !DILocation(line: 22, column: 18, scope: !52)
!87 = !DILocation(line: 22, column: 23, scope: !52)
!88 = !DILocation(line: 22, column: 26, scope: !52)
!89 = !DILocation(line: 22, column: 5, scope: !52)
!90 = !DILocation(line: 23, column: 5, scope: !52)
!91 = distinct !DISubprogram(name: "cip_if_print", scope: !92, file: !92, line: 24, type: !93, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !56)
!92 = !DIFile(filename: "print-cip.c", directory: "/app/se_runs/sailor_engine/tcpdump-4.9.2/094_print-cip.c_80_local_cpp_cwe-125-oob-read/harness", checksumkind: CSK_MD5, checksum: "d77cd0d856bd4fad478795ae540f9fc3")
!93 = !DISubroutineType(types: !94)
!94 = !{!28, !95, !101, !112}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdissect_options", file: !92, line: 13, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdissect_options", file: !92, line: 10, size: 64, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_eflag", scope: !97, file: !92, line: 11, baseType: !9, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_suppress_default_print", scope: !97, file: !92, line: 12, baseType: !9, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !13, line: 245, size: 192, elements: !104)
!104 = !{!105, !110, !111}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !103, file: !13, line: 246, baseType: !106, size: 128)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !17, line: 8, size: 128, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !106, file: !17, line: 14, baseType: !20, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !106, file: !17, line: 15, baseType: !24, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !103, file: !13, line: 247, baseType: !26, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !103, file: !13, line: 248, baseType: !26, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !92, line: 8, baseType: !35)
!115 = !DILocalVariable(name: "ndo", arg: 1, scope: !91, file: !92, line: 24, type: !95)
!116 = !DILocation(line: 24, column: 40, scope: !91)
!117 = !DILocalVariable(name: "h", arg: 2, scope: !91, file: !92, line: 24, type: !101)
!118 = !DILocation(line: 24, column: 71, scope: !91)
!119 = !DILocalVariable(name: "p", arg: 3, scope: !91, file: !92, line: 24, type: !112)
!120 = !DILocation(line: 24, column: 88, scope: !91)
!121 = !DILocation(line: 26, column: 5, scope: !91)
!122 = !DILocalVariable(name: "caplen", scope: !91, file: !92, line: 27, type: !28)
!123 = !DILocation(line: 27, column: 11, scope: !91)
!124 = !DILocation(line: 27, column: 20, scope: !91)
!125 = !DILocation(line: 27, column: 23, scope: !91)
!126 = !DILocalVariable(name: "length", scope: !91, file: !92, line: 28, type: !28)
!127 = !DILocation(line: 28, column: 11, scope: !91)
!128 = !DILocation(line: 28, column: 20, scope: !91)
!129 = !DILocation(line: 28, column: 23, scope: !91)
!130 = !DILocalVariable(name: "cmplen", scope: !91, file: !92, line: 29, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !132, line: 46, baseType: !133)
!132 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!133 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!134 = !DILocation(line: 29, column: 12, scope: !91)
!135 = !DILocalVariable(name: "llc_hdrlen", scope: !91, file: !92, line: 30, type: !9)
!136 = !DILocation(line: 30, column: 9, scope: !91)
!137 = !DILocation(line: 32, column: 12, scope: !91)
!138 = !DILocation(line: 33, column: 9, scope: !139)
!139 = distinct !DILexicalBlock(scope: !91, file: !92, line: 33, column: 9)
!140 = !DILocation(line: 33, column: 18, scope: !139)
!141 = !DILocation(line: 33, column: 16, scope: !139)
!142 = !DILocation(line: 33, column: 9, scope: !91)
!143 = !DILocation(line: 34, column: 18, scope: !139)
!144 = !DILocation(line: 34, column: 16, scope: !139)
!145 = !DILocation(line: 34, column: 9, scope: !139)
!146 = !DILocation(line: 35, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !91, file: !92, line: 35, column: 9)
!148 = !DILocation(line: 35, column: 18, scope: !147)
!149 = !DILocation(line: 35, column: 16, scope: !147)
!150 = !DILocation(line: 35, column: 9, scope: !91)
!151 = !DILocation(line: 36, column: 18, scope: !147)
!152 = !DILocation(line: 36, column: 16, scope: !147)
!153 = !DILocation(line: 36, column: 9, scope: !147)
!154 = !DILocation(line: 38, column: 9, scope: !155)
!155 = distinct !DILexicalBlock(scope: !91, file: !92, line: 38, column: 9)
!156 = !DILocation(line: 38, column: 14, scope: !155)
!157 = !DILocation(line: 38, column: 9, scope: !91)
!158 = !DILocation(line: 39, column: 19, scope: !155)
!159 = !DILocation(line: 39, column: 24, scope: !155)
!160 = !DILocation(line: 39, column: 9, scope: !155)
!161 = !DILocation(line: 41, column: 9, scope: !162)
!162 = distinct !DILexicalBlock(scope: !91, file: !92, line: 41, column: 9)
!163 = !DILocation(line: 41, column: 16, scope: !162)
!164 = !DILocation(line: 41, column: 9, scope: !91)
!165 = !DILocation(line: 42, column: 9, scope: !166)
!166 = distinct !DILexicalBlock(scope: !162, file: !92, line: 41, column: 22)
!167 = !DILocation(line: 42, column: 9, scope: !168)
!168 = distinct !DILexicalBlock(scope: !166, file: !92, line: 42, column: 9)
!169 = !DILocation(line: 43, column: 9, scope: !166)
!170 = !DILocation(line: 45, column: 44, scope: !171)
!171 = distinct !DILexicalBlock(scope: !91, file: !92, line: 45, column: 9)
!172 = !DILocation(line: 45, column: 47, scope: !171)
